# Capturing the Nan values with a new feature

## When to use?
### It works well if the data are not missing completely at random(MNAR)

In [25]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
%matplotlib inline
import seaborn as sns

pd.pandas.set_option("display.max_columns", None)
pd.pandas.set_option("display.max_rows",None)

In [26]:
df = pd.read_csv("titanic.csv", usecols = ["Age", "Fare", "Survived"])
df.head()

   Survived   Age     Fare
0         0  22.0   7.2500
1         1  38.0  71.2833
2         1  26.0   7.9250
3         1  35.0  53.1000
4         0  35.0   8.0500

In [27]:
df.isnull().mean()

Survived    0.000000
Age         0.198653
Fare        0.000000
dtype: float64

In [28]:
df.isnull().sum()

Survived      0
Age         177
Fare          0
dtype: int64

In [29]:
df["Age_NAN"] = np.where(df["Age"].isnull(),1,0)

In [32]:
df["Age"].median()

28.0

In [33]:
df["Age"].fillna(df["Age"].median(), inplace = True)

In [36]:
df.head(10)

   Survived   Age     Fare  Age_NAN
0         0  22.0   7.2500        0
1         1  38.0  71.2833        0
2         1  26.0   7.9250        0
3         1  35.0  53.1000        0
4         0  35.0   8.0500        0
5         0  28.0   8.4583        1
6         0  54.0  51.8625        0
7         0   2.0  21.0750        0
8         1  27.0  11.1333        0
9         1  14.0  30.0708        0

# Advantages
## 1) Easy to implement
## 2) Captures the importance of missing value

# Disadvantages
## 3) creating Additional features(Curse of dimensionality)